## Staging: network

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
aws_vpc.main: Refreshing state... [id=vpc-0d895a01b47ccfb04]
aws_eip.lambda: Refreshing state... [id=eipalloc-06155a058c941b5dd]
aws_cloudwatch_log_group.vpc_metrics_flow_logs: Refreshing state... [id=vpc_metrics_flow_logs]
aws_iam_role.vpc_metrics_flow_logs: Refreshing state... [id=vpc_metrics_flow_logs]
aws_iam_policy.vpc_metrics_flow_logs_write: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertMetricsVpcFlowLogs]
aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write: Refreshing state... [id=vpc_metrics_flow_logs-20210608194928022400000001]
aws_subnet.private: Refreshing state... [id=subnet-07f256fc1e9b65732]
aws_internet_gateway.gw: Refreshing state... [id=igw-08031402dc515616c]
aws_default_network_acl.default: Refreshing state... [id=acl-0a293e49ea86cc7ce]
aws_flow_log.vpc_metrics_flow_logs: Refreshing state... [id=fl-0051ffdba620c78d1]
aws_default_route_table.default: Refreshing state... [id=rtb-0228b7d35bdfba348]
aws_subnet.public: Refreshing state... [id=subnet-066a4cc52f615255c]
aws_security_group.efs: Refreshing state... [id=sg-0e73d581666d1f412]
aws_security_group.lambda: Refreshing state... [id=sg-090d16d17a0b6c2b1]
aws_default_security_group.default: Refreshing state... [id=sg-07bbdcb4fc6d20a75]
aws_route_table.public: Refreshing state... [id=rtb-0c40a8fd1f51baec7]
aws_security_group_rule.efs_egress: Refreshing state... [id=sgrule-235191165]
aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-1598225514]
aws_security_group_rule.efs_ingress: Refreshing state... [id=sgrule-2369537510]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-09d9428ba0886977f]
aws_network_acl.main: Refreshing state... [id=acl-0af86631764523f8a]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-03329e92062edf232]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-09e7050aa7d123674]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05cc02536d86ce34d]
aws_route_table.private: Refreshing state... [id=rtb-08c76912dc727184b]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-0043ca13d1dec5810]
aws_security_group_rule.s3_private_link: Refreshing state... [id=sgrule-2802359572]
aws_security_group_rule.dynamodb_privatelink: Refreshing state... [id=sgrule-2068073685]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-0af86631764523f8a"
      ~ subnet_ids = [
          - "subnet-066a4cc52f615255c",
          - "subnet-07f256fc1e9b65732",
        ] -> (known after apply)
        tags       = {
            "Name" = "metricsstaging_main_nacl"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table_association.a must be replaced
-/+ resource "aws_route_table_association" "a" {
      ~ id             = "rtbassoc-0043ca13d1dec5810" -> (known after apply)
      ~ subnet_id      = "subnet-07f256fc1e9b65732" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.private must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                             = "arn:aws:ec2:ca-central-1:005133826942:subnet/subnet-07f256fc1e9b65732" -> (known after apply)
      ~ availability_zone               = "ca-central-1d" -> "ca-central-1a" # forces replacement
      ~ availability_zone_id            = "cac1-az4" -> (known after apply)
      ~ id                              = "subnet-07f256fc1e9b65732" -> (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      - map_customer_owned_ip_on_launch = false -> null
      ~ owner_id                        = "005133826942" -> (known after apply)
        tags                            = {
            "Name" = "metricsstaging_private_subnet"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ private_subnet_id = "subnet-07f256fc1e9b65732" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>